# ApplicationEntryPoint Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint Methods
ApplicationEntryPoint Class See Also
---
The ApplicationEntryPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CopyModel | Copies an existing model to a new file. Overwriting a file of the same name is allowed.  (Inherited from Application.) |
| Dispose | (Inherited from Application.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| ExtractPartAtomFromFamilyFile | Writes a PartAtom XML from the contents of a family file.  (Inherited from Application.) |
| FinishInitializationEO | For Revit Macros internal use only. |
| GetAssets | Gets all the Assets of the specified type.  (Inherited from Application.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLibraryPaths | Returns path information identifying where Revit searches for content.  (Inherited from Application.) |
| GetRevitServerNetworkHosts | Gets the list of all Revit Server Network hosts in current session.  (Inherited from Application.) |
| GetSystemsAnalysisWorkflowNames | Returns names for systems analysis workflows.  (Inherited from Application.) |
| GetSystemsAnalysisWorkflows | Returns name and path information identifying systems analysis workflow files.  (Inherited from Application.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWorksharingCentralGUID | Gets the worksharing central GUID of the given server-based model.  (Inherited from Application.) |
| Initialize | For Revit Macros internal use only. |
| IsJournalPlaying | Determines if the application is currently in journal playback mode.  (Inherited from Application.) |
| NewFamilyDocument | New family document, including family, titleblock, and annotation symbol  (Inherited from Application.) |
| NewProjectDocument(String) | New project document  (Inherited from Application.) |
| NewProjectDocument(UnitSystem) | Creates a new project document with no template file specified.  (Inherited from Application.) |
| NewProjectTemplateDocument | New project template document  (Inherited from Application.) |
| OnShutdownEO | For Revit Macros internal use only. |
| OpenDocumentFile(String) | Opens a document from disk.  (Inherited from Application.) |
| OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud.  (Inherited from Application.) |
| OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud.  (Inherited from Application.) |
| OpenIFCDocument(String) | Opens an IFC document from disk using default options.  (Inherited from Application.) |
| OpenIFCDocument(String, IFCImportOptions) | Opens an IFC document from disk using custom options.  (Inherited from Application.) |
| OpenSharedParameterFile | Enables access to shared parameter groups and definitions that are maintained on disk. (Inherited from Application.) |
| PurgeReleasedAPIObjects | Explicitly purges all API objects that have been released but are still awaiting to be finalized  (Inherited from Application.) |
| SetLibraryPaths | Sets path information identifying where Revit searches for content.  (Inherited from Application.) |
| SetSystemsAnalysisWorkflows | Sets name and path information identifying systems analysis workflow files.  (Inherited from Application.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| UpdateRenderAppearanceLibrary | Updates the stored render appearance library, giving the Revit session access to any new RPC content.  (Inherited from Application.) |
| WriteJournalComment | Writes a comment to the Revit journal file.  (Inherited from Application.) |

# See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace